[
  "Rob a convenience store in a clown costume.",
  "Steal a tank, then use it only to go shopping.",
  "Parachute from the Maze Bank Tower directly into a swimming pool.",
  "Race luxury cars on the golf course.",
  "Host a jet ski race through the Los Santos sewer system.",
  "Play chicken with trains in golf carts.",
  "Host a fistfight tournament atop Mt. Chiliad.",
  "Park helicopters inside the Los Santos Customs.",
  "Organize a peaceful protest against NPC drivers.",
  "Fill your apartment garage entirely with bicycles.",
  "Try to land a Titan on the Vespucci Pier.",
  "Have a demolition derby on top of a skyscraper.",
  "Dress as an alien and abduct random players in helicopters.",
  "Host a \"Tour de Chiliad\" bicycle race.",
  "Jump motorcycles onto the moving train.",
  "Stage an elaborate bank robbery using only golf clubs.",
  "Hold an underwater car meet at the bottom of the ocean.",
  "Fly upside down under every bridge in Los Santos.",
  "Play hide and seek using cargo containers.",
  "Try racing NPC pedestrians.",
  "Drive a lawnmower from Paleto Bay to the city.",
  "Fill your yacht’s hot tub with NPCs (kidnap them with helicopters).",
  "Try delivering pizzas using a fighter jet.",
  "Do an entire heist in swimwear.",
  "Host a tractor race through downtown traffic.",
  "Attempt to skydive onto a friend's jet mid-flight.",
  "Park a boat in front of Maze Bank Arena.",
  "Wear a scuba suit and pretend to be a fish in Vespucci Canals.",
  "Do donuts in a limousine.",
  "Organize synchronized swimming events in random NPC pools.",
  "Play musical chairs with stolen vehicles.",
  "Host a marathon across the entire map without using vehicles.",
  "Stage a formal wedding at Ammu-Nation.",
  "Attempt BMX tricks on a yacht.",
  "Invade the military base dressed as construction workers.",
  "Have a submarine race around the map.",
  "Host a taco truck drag race.",
  "Try to jump a speedboat over a yacht.",
  "Dress as firefighters and spray random NPCs.",
  "Race forklifts through Los Santos traffic.",
  "Try golfing grenades instead of golf balls.",
  "Kidnap NPCs using golf carts.",
  "Play bumper cars with stolen police cruisers.",
  "Dress as security guards and pretend to guard a tree.",
  "Do a mission using only your fists.",
  "Go fishing with sticky bombs.",
  "Host a clown parade through downtown.",
  "Fly a blimp upside down.",
  "Challenge players to tennis matches with rocket launchers.",
  "Steal a jet and attempt to parallel park it downtown.",
  "Host a yoga session in the middle of the freeway.",
  "Take selfies mid-police chase.",
  "Run a \"pet adoption center\" with kidnapped NPCs.",
  "Host a synchronized helicopter dance show.",
  "Attempt to navigate the entire map blindfolded.",
  "Host drag races on Vespucci Beach.",
  "Stage \"Olympics\" events using construction equipment.",
  "Kidnap NPCs and form a choir on a rooftop.",
  "Take a submarine through the canals.",
  "Have a fashion show in the police station lobby.",
  "Fill a garage with police bikes.",
  "Have an obstacle course race with stolen ambulances.",
  "Host a limo pool party (drive limo into swimming pools).",
  "Drive golf carts through fast-food drive-thrus.",
  "Dress as pirates and invade the yacht parties.",
  "Play darts using explosive projectiles.",
  "Try to tow a jet using a tow truck.",
  "Host a rock-climbing event on Mt. Chiliad with cars.",
  "Race buses around Sandy Shores.",
  "Host a cooking competition using grenades.",
  "Try delivering goods via jetpack.",
  "Turn the casino into a bike park.",
  "Host horse races using dirt bikes.",
  "Stage elaborate \"street magician\" events.",
  "Try to build a traffic jam spanning the entire freeway.",
  "Fill a penthouse with NPC bodyguards.",
  "Host a pet show using attack dogs from police NPCs.",
  "Race NPCs by foot across Los Santos International Airport.",
  "Kidnap NPCs to form a soccer team.",
  "Go bowling using grenades and NPC pedestrians.",
  "Host a beauty pageant in a gang-infested neighborhood.",
  "Do missions entirely in reverse gear.",
  "Have a pizza party at the top of Maze Bank.",
  "Build a mountain of cars and blow it up.",
  "Race monster trucks down narrow alleyways.",
  "Try surfing a plane.",
  "Host demolition derbies in the desert.",
  "Kidnap NPCs and \"sell\" them as expensive art installations.",
  "Attempt a stunt jump through an active heist scene.",
  "Race luxury cars through Vinewood Hills backward.",
  "Throw parties inside convenience stores.",
  "Host a ski race (cars sliding downhill).",
  "Pretend to be NPC pedestrians and follow real players around.",
  "Start a fashion trend among NPCs.",
  "Land jets on top of other jets mid-flight.",
  "Turn the Del Perro Pier into a racetrack.",
  "Have a boat party in a swimming pool.",
  "Play basketball using grenades.",
  "Try to steal a submarine with a tow truck.",
  "Host a \"sleepover\" inside Los Santos Customs.",
  "Street race scooters.",
  "Parachute into traffic.",
  "Become NPC paparazzi.",
  "Host jetpack races.",
  "Hide-and-seek in the subway.",
  "Deliver pizzas in tanks.",
  "Race airport luggage carts.",
  "Golf cart jousting.",
  "Build car pyramids.",
  "Police bike stunts.",
  "Limo off-roading.",
  "Taxi race through alleys.",
  "Parkour with tractors.",
  "Bus stunts on highways.",
  "Ambulance chase police.",
  "Helicopter sumo wrestling.",
  "BMX off skyscrapers.",
  "Alien vs. clown battles.",
  "Grenade basketball tournament.",
  "Host races on train tracks.",
  "Motorcycle jousting.",
  "Cargo plane surfing.",
  "Underwater tennis.",
  "Firetruck street cleaning.",
  "Crane diving.",
  "Blimp bowling.",
  "Police station party.",
  "Emergency services races.",
  "Ferris wheel shootouts.",
  "Freeway sprint races.",
  "Bank robbery using scooters.",
  "Car surfing competitions.",
  "Airplane tunnel challenges.",
  "Tractor pulls with sports cars.",
  "Skateboarding on yachts.",
  "Pretend nightclub security.",
  "Zombie walk through city.",
  "Extreme ambulance stunt jumps.",
  "UFO hunting.",
  "Shark spotting contests.",
  "ATM machine selfies.",
  "NPC fashion parades.",
  "Swimming pool yacht parties.",
  "Beach tank invasions.",
  "Jet-skiing through traffic.",
  "Base-jumping from blimps.",
  "Airport runway parties.",
  "Plane golf (landing planes near golf course).",
  "Helicopter drag races.",
  "Motorcycle carwash invasions.",
  "Escape a 5-star wanted level using only a bicycle.",
  "Launch motorcycles off a moving cargo plane.",
  "Dress as chefs and host a “cooking show” in an Ammu-Nation.",
  "Swim across the Alamo Sea... while being chased by jets.",
  "Attempt synchronized crashing (timed car explosions).",
  "Kidnap NPCs and “sell” them at the docks.",
  "Try to get police to chase you into the ocean.",
  "Do a heist in scuba suits.",
  "Take over an NPC wedding venue and make it your “gang HQ.”",
  "See how many buses can fit inside an aircraft hangar.",
  "Host a city-wide taxi driver competition.",
  "Turn a strip club into a police station (via costumes and roleplay).",
  "Helicopter jousting with blades only.",
  "Toss tear gas into elevators and see who gets out first.",
  "Go ghost hunting in the graveyard with fireworks.",
  "Do an entire CEO mission with go-karts.",
  "Build a maze out of cars in the middle of the freeway.",
  "Use only melee weapons for a gang war.",
  "Flood the subway with firetrucks.",
  "Try to rob stores using a snowball.",
  "Launch yourself across the map using car explosions.",
  "Fill a nightclub with motorcycles and try to dance.",
  "Use the orbital cannon… on a parked bicycle.",
  "Do a cargo run using only scooters.",
  "Try to survive on foot on the freeway during rush hour.",
  "Pretend to be wildlife conservationists and rescue deer.",
  "Host a cult meeting on a mountaintop.",
  "Try to land a blimp on the back of a truck.",
  "Ride a BMX down a skyscraper stairwell.",
  "Play “tag” with sticky bombs.",
  "Try to push an entire train off the track with dump trucks.",
  "Host an “NPC Interview Show” on the beach.",
  "Fill a garage with rust buckets and host a car show.",
  "Pretend to be a valet and steal people’s cars.",
  "Kidnap NPCs and host a fake talk show.",
  "Drive all the way to the observatory… backwards.",
  "Try to get five police helicopters to follow you into a tunnel.",
  "Park a luxury car in a gang hideout and pretend it’s a peace offering.",
  "Roleplay as aliens and demand tribute from players.",
  "Use the water cannon on NPCs until they dance.",
  "Set up roadside taco stands with food trucks.",
  "Try to make an NPC your best friend by protecting them all day.",
  "Stage a wedding with you and your Oppressor Mk II.",
  "Pretend to be paparazzi and chase high-end NPCs.",
  "Hold a fashion show inside a subway station.",
  "Host a family barbecue on the roof of a moving bus.",
  "Host a full-blown party on the Vinewood sign.",
  "Use flare guns only in a team deathmatch.",
  "Pretend to be spies and do recon on innocent players.",
  "Host a petting zoo with stolen deer and mountain lions.",
  "Do drive-bys using water pistols (or pretend to using flare guns).",
  "Recreate a scene from Fast & Furious… but only with scooters.",
  "Try to walk from the airport to Sandy Shores in first-person mode.",
  "Create a car domino chain in a parking garage.",
  "Blow up your own yacht while screaming “I regret nothing!”",
  "Paint all your vehicles hot pink and try to start a gang war.",
  "Try to survive in the wilderness with no vehicles or weapons.",
  "Lure police into a maze made of buses.",
  "Build a player jail with your friends and try to escape it.",
  "Start a cult that worships the dump truck.",
  "Pretend to be a ghost in a haunted house server session.",
  "Wear scuba gear and pretend to be a fish for a full mission.",
  "Start a “no kill” protest in front of the police station.",
  "Host a drifting contest on the beach.",
  "Hijack a train and throw a tea party on it.",
  "Attempt a “silent heist” with only melee weapons and stealth.",
  "Parachute into a moving dump truck bed.",
  "Play a live game show inside an armored truck.",
  "Get a 5-star wanted level, then try to order fast food.",
  "Race dump trucks up Mt. Chiliad.",
  "Conduct a fake “car wash inspection” with flare guns.",
  "Attempt to \"sneak\" into Fort Zancudo dressed as clowns.",
  "Start a “rescue NPCs from traffic” campaign.",
  "Host a sumo match on top of the tallest building.",
  "Make a horror movie trailer starring NPCs and mannequins.",
  "Put a sticky bomb on a boat and play “hot potato.”",
  "Roleplay as a street preacher and yell at traffic.",
  "Ride in a convertible during a thunderstorm with 4 people yelling.",
  "Drive through a gang territory honking cheerfully.",
  "Stage an impromptu concert in the subway tunnels.",
  "Roleplay as airport security and inspect everyone’s bags.",
  "Start a “Save the Los Santos Trees” campaign.",
  "Pretend to be the paparazzi and chase armored trucks.",
  "Try to do a cargo delivery while constantly honking.",
  "Use a cargo bob to airlift NPCs to “safety.”",
  "Make a music video with all the wrong vehicles.",
  "Do a survival mission wearing beachwear and flip-flops.",
  "Host an Oppressor Mk II ballet show.",
  "Try to hitchhike rides from random players.",
  "Pretend to be a detective solving NPC crimes.",
  "Try to build a functional vehicle ramp using other players' cars.",
  "Organize a car wash with actual fire hoses.",
  "Host an intergalactic council meeting (alien costumes only).",
  "Race boats down a freeway.",
  "Park 10 motorcycles inside a small gas station and set off fireworks.",
  "Drive a hearse through the Vinewood Hills and host a séance.",
  "Recreate Jurassic Park using only dune buggies and players in animal masks.",
  "Make a “medieval jousting” tournament with trucks and crowbars.",
  "Build a bowling alley with buses and use a flaming car as the ball.",
  "Try to land a Dodo on top of a moving train.",
  "Start a turf war between clowns and aliens in the Vinewood Bowl.",
  "Do a photoshoot in front of every Ammu-Nation while making peace signs.",
  "Fill an entire public lobby with Pegasus vehicles.",
  "Organize a “silent disco” in the middle of the freeway.",
  "Play \"king of the hill\" on top of a blimp.",
  "Pretend to be a valet and crash every car you're handed.",
  "Host a spelling bee using sticky bombs to eliminate losers.",
  "Recreate a cooking show while blowing up food trucks.",
  "Race around the map using only the turbo boost on your rocket car.",
  "Attempt to roleplay a courtroom session inside a police station.",
  "Host a shark hunting expedition using helicopters and pipe bombs.",
  "Parachute into a pool party and pretend you were invited.",
  "Play red light/green light with a train.",
  "Set up a “high-speed toll booth” with sticky bombs.",
  "Stage a funeral for a blown-up bicycle.",
  "Use golf clubs to fight off a 5-star wanted level.",
  "Host a treasure hunt using nothing but clues and explosives.",
  "Deliver CEO cargo in the slowest vehicle you can find.",
  "Try to join an NPC family picnic without getting attacked.",
  "Dress as Santa and deliver Molotovs to players.",
  "Land a plane inside the casino parking garage.",
  "Start a riot in the mall by honking and throwing snowballs.",
  "Race through the sewers in monster trucks.",
  "Dress in scuba gear and try to join a fire crew.",
  "Do yoga in the middle of an active gang war.",
  "Host a therapy session for NPCs at the beach.",
  "Build a giant pyramid out of abandoned cars.",
  "Attempt synchronized swimming in the LS river.",
  "Try to win a race without pressing the gas pedal.",
  "Launch yourself from a ramp into a moving blimp.",
  "Host a BBQ with flaming fuel tanks.",
  "Ride a rollercoaster with five stars and no weapons.",
  "Try to “camouflage” as a statue and surprise players.",
  "Stage a drive-in movie experience using parked cars and grenades.",
  "Launch a protest for NPCs to unionize.",
  "Recreate \"Titanic\" on a tugboat.",
  "Start a petting zoo with sharks and mountain lions.",
  "Hold a press conference on the freeway.",
  "Pretend to be a wedding planner for NPC couples.",
  "Create an “escape room” using firetrucks and buses.",
  "Hold auditions for a movie starring only pedestrians.",
  "Race 18-wheelers down a mountain trail.",
  "Try to outrun a jet using only swimming.",
  "Park a hearse outside every hospital.",
  "Break into a police station just to use the vending machine.",
  "Build a floating car raft on the ocean using the Cargobob.",
  "Host a submarine dance party.",
  "Make a \"haunted house\" out of a gang hideout.",
  "Take selfies during every explosion in a mission.",
  "Host a firework show using nothing but RPGs.",
  "Try to open a luxury hotel in the desert using porta-potties and Molotovs.",
  "Host a full wedding ceremony for you and your car… with guests.",
  "Create a haunted boat tour through sunken wreckage.",
  "Become a “street sign repairman” and guard random poles with your life.",
  "Paint every vehicle bright yellow and start a fake taxi company.",
  "Start a public \"therapy group\" on the highway median.",
  "Attempt to rob a store using only honking as intimidation.",
  "Play “hide the tank” in plain sight and see how long it lasts.",
  "Use sticky bombs to make a “fireworks finale” when a mission ends.",
  "Race lawnmowers through the Vinewood Hills at night.",
  "Put traffic cones around an NPC and declare it a crime scene.",
  "Ride an Oppressor Mk II backwards across the entire map.",
  "Pretend to be a substitute bus driver and steal all the school buses.",
  "Create a giant domino effect using parked motorcycles.",
  "Hold an illegal rave in the subway while being chased by cops.",
  "Pretend to be a movie director and interrupt NPC scenes with grenades.",
  "See how many gang territories you can “liberate” using only smoke grenades.",
  "Host a fake court trial on a boat.",
  "Turn the Vinewood Bowl into a dirt bike arena.",
  "Cover the entire Maze Bank helipad in proximity mines and host a rooftop yoga class.",
  "Park a tank at the drive-thru and demand service.",
  "Dress as medieval knights and swordfight in a back alley with machetes.",
  "Drive in circles around one NPC until they run away.",
  "Create a \"human zoo\" for NPCs using barriers and cars.",
  "Deliver snacks to players in the middle of gunfights.",
  "Pretend to be Uber for stolen police cars.",
  "Form a motorcycle gang made entirely of mopeds.",
  "Try to flip an 18-wheeler onto a roof using ramps.",
  "Do a slow-motion dive into a pool… while being shot at.",
  "Host a “car fashion show” with categories like “Worst Paint Job” and “Ugliest Rims.”",
  "Fill the Vinewood sign with flares to spell rude messages.",
  "Ride a BMX off a blimp onto a helicopter.",
  "Use a jet to write “HI” in the sky with missile smoke trails.",
  "Dress as Elvis and host a rooftop concert with grenades.",
  "Try to get into the prison peacefully… and then demand to be released.",
  "Roleplay as an NPC traffic officer and direct traffic with a baseball bat.",
  "Play whack-a-mole with grenades and sewer exits.",
  "Turn a fast food restaurant into a nightclub with speakers and fireworks.",
  "Have a staring contest with a gang leader.",
  "Kidnap 5 NPCs and try to start a barbershop quartet.",
  "Declare yourself mayor of a parking lot and tax people for entry.",
  "Host a Red Carpet event using trash bags as outfits.",
  "Build a “car cannon” using ramps and sticky bombs.",
  "Try to run across the airport with 5 stars and no armor.",
  "Build an escape pod system using bikes and Cargobobs.",
  "Start a player-run haunted hayride in the Blaine County woods.",
  "Hide in a bush and narrate pedestrians like a nature documentary.",
  "Turn the Ferris wheel into a trap by rigging it with C4.",
  "Run for President of Los Santos… and campaign with grenades.",
  "Host a talent show with only honking and dance emotes.",
  "Drive a golf cart into every gang hideout and shout, “Carpool’s here!”",
  "Do the “Hot Coffee” date scene but with a tank and no romance.",
  "Ride a shopping cart down the Vinewood Hills (or pretend to with a BMX).",
  "Put an NPC on a jet ski and see where they go.",
  "Blow up an entire parking garage while narrating like David Attenborough.",
  "Ride a parachute bike (yes, make it happen) off the tallest building.",
  "Do the heist finale… wearing scuba gear, clown masks, and no weapons.",
  "Pretend to be the LSPD hiring new officers… by attacking everyone.",
  "Do a no-death challenge using only a Vespa and a knife.",
  "Host a \"Summer Camp\" with players and NPCs at a campsite.",
  "Set up speed bumps using people’s cars and run a “Safety Inspection.”",
  "Start a Ponsonbys fashion line called “Explosive Casualwear.”",
  "Try to summon Bigfoot by setting fire to trees at 3 a.m.",
  "Build a UFO landing zone and send out distress flares.",
  "Park all your cars in a perfect circle on the beach… and walk away in slow motion while they explode behind you."
]